results/ryzen9-7950x-node0/e2e-v2/runs/q-h1-adaptive-direct/h2load.txt
starting benchmark...
spawning thread #0: 16 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #1: 16 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #2: 16 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
spawning thread #3: 16 total client(s). Timing-based test with 0s of warm-up time and 20s of main duration for measurements.
Warm-up started for thread #1.
Warm-up started for thread #3.
Warm-up started for thread #2.
Warm-up started for thread #0.
progress: 6% of clients started
progress: 12% of clients started
progress: 18% of clients started
progress: 25% of clients started
progress: 31% of clients started
progress: 37% of clients started
progress: 43% of clients started
progress: 50% of clients started
progress: 56% of clients started
progress: 62% of clients started
progress: 68% of clients started
progress: 75% of clients started
progress: 81% of clients started
progress: 87% of clients started
progress: 93% of clients started
progress: 100% of clients started
Warm-up phase is over for thread #Warm-up phase is over for thread #23..
Main benchmark duration is started for thread #3.

Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #Main benchmark duration is started for thread #0.
Warm-up phase is over for thread #1.
Main benchmark duration is started for thread #1.
2.
Application protocol: http/1.1
Main benchmark duration is over for thread #1. Stopping all clients.
Main benchmark duration is over for thread #Stopped all clients for thread #1
0. Stopping all clients.
Stopped all clients for thread #0
Main benchmark duration is over for thread #3. Stopping all clients.
Stopped all clients for thread #3
Main benchmark duration is over for thread #2. Stopping all clients.
Stopped all clients for thread #2

finished in 20.00s, 298913.15 req/s, 1.26GB/s
requests: 5978263 total, 5978327 started, 5978263 done, 5978263 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 5978263 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 25.19GB (27045662516) total, 667.06MB (699460398) headers (space savings 0.00%), 24.32GB (26113188896) data
                     min         max         mean         sd        +/- sd
time for request:       26us     90.13ms       218us       433us    99.60%
time for connect:        1us       123us        63us        34us    59.38%
time to 1st byte:    74.89ms     90.13ms     81.80ms      5.10ms    50.00%
req/s           :    4646.04     4722.98     4670.48       21.41    82.81%